Revit 2027 API
TextNode.BaseDirection Property
 Direction of the base line of the text object in model space.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ BaseDirection { get; }
Public ReadOnly Property BaseDirection As XYZ
	Get
public:
property XYZ^ BaseDirection {
	XYZ^ get ();
}
member BaseDirection : XYZ with get
Property Value
XYZ
See Also
Reference
TextNode Class
Autodesk.Revit.DB Namespace